app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @artist = Artist.find_or_create_by(id: params[:artist_id])
---
INSERT INTO "artists" ("id", "created_at", "updated_at") VALUES (?, ?, ?)  [["id", 0], ["created_at", "2018-01-28 01:05:24.463323"], ["updated_at", "2018-01-28 01:05:24.463323"]]