app/controllers/songs_controller.rb

  def show
    if params[:artist_id]
      @artist = Artist.find_by(:id => params[:artist_id])
      if @artist.nil?
        redirect_to artist_songs_path(@artist), alert: "Song not found"
      else
        @songs = @artist.songs
      end
      else
    @song = Song.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]